{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "GooglePlayPurchase",
			"Children": [
				{
					"Source":
					{
						"Text": "Failed to checkout, no offers given."
					},
					"Translation":
					{
						"Text": "فشل إتمام عملية الشراء؛ لم تقدَّم أي عروض."
					},
					"Key": "ErrorNoOffersSpecified"
				},
				{
					"Source":
					{
						"Text": "Failed to checkout, user has in progress transaction."
					},
					"Translation":
					{
						"Text": "فشل إتمام عملية الشراء؛ لدى المستخدم معاملة جارية."
					},
					"Key": "ErrorTransactionInProgress"
				},
				{
					"Source":
					{
						"Text": "Failed to checkout, user not allowed to purchase."
					},
					"Translation":
					{
						"Text": "فشل إتمام عملية الشراء؛ غير مسموح للمستخدم بالشراء."
					},
					"Key": "ErrorPurchaseNotAllowed"
				}
			]
		},
		{
			"Namespace": "OnlineSubsystemGooglePlay",
			"Children": [
				{
					"Source":
					{
						"Text": "Google Play"
					},
					"Translation":
					{
						"Text": "Google Play"
					},
					"Key": "OnlineServiceName"
				},
				{
					"Source":
					{
						"Text": "Invalid purchase result"
					},
					"Translation":
					{
						"Text": "نتيجة شراء غير صالحة"
					},
					"Key": "GooglePlayInvalidState"
				},
				{
					"Source":
					{
						"Text": "Transaction Canceled"
					},
					"Translation":
					{
						"Text": "أُلغيت المعاملة"
					},
					"Key": "GooglePlayTransactionCancel"
				},
				{
					"Source":
					{
						"Text": "Transaction Failed"
					},
					"Translation":
					{
						"Text": "فشلت المعاملة"
					},
					"Key": "GooglePlayTransactionFailed"
				},
				{
					"Source":
					{
						"Text": "Unexpected purchase result"
					},
					"Translation":
					{
						"Text": "نتيجة شراء غير متوقعة"
					},
					"Key": "GooglePlayUnexpectedState"
				}
			]
		}
	]
}